Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: The typed buffer references self.count / MemoryLayout<T>.stride instances of T.
ja: 型付バッファは、Tのself.count / MemoryLayout<T>.strideインスタンスを参照します。

source: The typed buffer to convert to a raw buffer.
ja: 新しいバッファへと変換されることになる型付バッファ。

source: The typed pointer to convert.
ja: 変換されることになる型付ポインタ。

source: The unbounded range operator (...) is valid only within a collection’s subscript.
ja: 無境界範囲演算子（...）は、あるコレクションの添字の内でのみ有効です。

source: The underlying collection of the slice.
ja: このスライスの基礎をなすコレクション。

source: The underlying type a string uses when it wraps itself in a data value.
ja: ある文字列が、それがそれ自身をあるデータ値の中にラップする時に使う、基礎をなす型。

source: The universal hash function used by Set and Dictionary.
ja: SetとDictionaryによって使われる普遍的なハッシュ関数。

source: The updated version uses Swift’s concurrency features to provide clearer code with better error checking at compile time.
ja: 更新されたバージョンは、Swiftの並行性機能を使って、明快なコードをより良いコンパイル時でのエラーチェックとともに提供します。

source: The upper and lower bounds of bounds must be valid indices of the string and not equal to the string’s end index.
ja: bounds範囲の上方および下方の境界はこの文字列の有効なインデックスでなければなりません、そしてこの文字列の持つ末尾インデックスと等しくてはなりません。

source: The upper and lower bounds of bounds must be valid indices of the string.
ja: boundsの上方および下方の境界は、文字列の有効なインデックスでなければなりません。

source: The upper and lower bounds of the range must be in the range 0...count.
ja: この範囲の上方および下方の境界は、範囲0...countの中でなければなりません。

source: The upper bound for the randomly generated value.
ja: この無作為に生成される値に対する上方の境界。

source: The upper bound for the range.
ja: 範囲の上側の境界。

source: The uppercase mapping of the scalar.
ja: このスカラーのアッパーケースマッピング。

source: The valid indices for subscripting the vector.
ja: ベクターに添え字での指定をするための有効なインデックスそれら。

source: The value is available throughout the execution of the operation closure, including any get operations performed by child-tasks created during the execution of the operation closure.
ja: 値が利用可能なのは、演算クロージャの遂行の間じゅうです、演算クロージャの遂行の間に作成された子タスクによって実行されたあらゆるget演算を含めて。

source: The value is only bound for the duration of that scope, and is available to any child tasks which are created within that scope.
ja: 値は、そのスコープの持続期間に対してバインドされるだけです、そしてそのスコープ内で作成されたすべての子タスクに利用可能です。

source: The value of count must be greater than or equal to zero.
ja: countの値は、ゼロより大きいか等しくなければなりません。

source: The value of maxLength must be greater than or equal to zero.
ja: maxLengthの値は、ゼロより大きいか等しくなければなりません。

source: The value of the new instance.
ja: 新しいインスタンスのための値。

source: The value of the operand is copied bitwise into a temporary nonowning buffer.
ja: 演算数の値は、コピーされます。一時的な非所有バッファにビット単位でコピーされるものです。

source: The value of this string.
ja: この文字列の値。

source: The value passed as distance must not offset i beyond the bounds of the collection, unless the index passed as limit prevents offsetting beyond those bounds.
ja: distanceとして渡される値は、このコレクションの境界を越えてiを補ってはなりません、limitとして渡されるインデックスがそれら境界を越えて補うのを防止するのでない限りは。

source: The value passed as distance must not offset i beyond the bounds of the collection.
ja: distanceとして渡される値は、このコレクションの境界を越えてiを補ってはなりません。

source: The value passed as n must not offset i beyond the bounds of the collection, unless the index passed as limit prevents offsetting beyond those bounds.
ja: nとして渡される値は、このコレクションの境界を越えてiを補ってはなりません、limitとして渡されるインデックスがそれら境界を越えて補うのを防止するのでない限りは。

source: The value passed as n must not offset i beyond the bounds of the collection.
ja: nとして渡される値は、このコレクションの境界を越えてiを補ってはなりません。

source: The value passed as source must be representable in this type.
ja: sourceとして渡される値は、この型において表現可能でなければなりません。

source: The value returned by the next child task that completes.
ja: 完了した次の子タスクによって返された値。

source: The value to add to this value.
ja: この値に加える値。

source: The value to calculate the distance to.
ja: それへの隔たりを計算される値。

source: The value to convert to a string.
ja: 文字列へ変換する値。

source: The value to create.
ja: 作成されることになる値。

source: The value to divide lhs by.
ja: この値でlhsを除算します。

source: The value to divide this value by.
ja: この値を除算するための値。

source: The value to divide.
ja: 除算することになる値。

source: The value to encode.
ja: エンコードする値。

source: The value to multiply by this value.
ja: この値と掛け合わせられることになる値。

source: The value to multiply this value by.
ja: この値に掛ける値。

source: The value to return from an awaiting call to next.
ja: 次への待機している呼び出しから返すことになる値。

source: The value to return from the continuation.
ja: その継続から返す値。

source: The value to shift.
ja: シフトする値。

source: The value to store as raw bytes.
ja: 生のメモリとして格納されることになる値。

source: The value to subtract from lhs.
ja: lhsから減じる値。

source: The value to subtract from this value.
ja: この値から減じる値。

source: The value to test.
ja: テストする値。

source: The value to use as the initial accumulating value.
ja: 最初から蓄積されている値として使われる値。

source: The values returned by successive calls to this method appear in the order that the tasks completed, not in the order that those tasks were added to the task group.
ja: このメソッドへの連続した呼び出しによって返される値それらは、タスクそれらが完了した順に現れます、それらタスクがタスクグループに加えられた順にではなく。

source: The view to use for the index conversion.
ja: インデックス変換に使うビュー。

source: The width of x when encoded in UTF-16, either 1 or 2.
ja: UTF-16でエンコードされる時のxの幅、1または2のどちらか。

source: The width of x when encoded in UTF-8, from 1 to 4.
ja: UTF-8で符号化された時のxの幅、1から4まで。

source: The zero value.
ja: ゼロ値。

source: The zero width joiner is also used to construct complex emoji from sequences of base emoji characters.
ja: ゼロ幅接合子はまた、複合絵文字を一連の基礎絵文字文字から組み立てるために使われます。

source: The “past the end” index of the resulting subsequence.
ja: 結果のシーケンスの「終わりを過ぎた」インデックス。

source: The “past the end” position—that is, the position one greater than the last valid subscript argument.
ja: 「終わりを過ぎた」位置—すなわち、最後の有効な添え字引数より１つ大きい位置。

source: Then build and run the app in Simulator, and follow these steps:
ja: それからアプリをシミュレータ上でビルドおよび実行してください、そしてこれらの手順に従ってください：

source: There are two scalars for which this property is true:
ja: それに対してこのプロパティがtrueである２つのスカラーがあります：

source: Therefore, the first in any sequence of mutating operations may cost O(n) time and space.
ja: それゆえに、何らかの一連の変化を伴う演算において最初に、O(n)時間と空間を要するでしょう。

source: These collections can store zero, one, or many of the same element.
ja: これらのコレクションは、ゼロ、１つ、または多くの同じ要素を格納できます。

source: These counters can be used as indices only in instances of zero-based, integer-indexed collections, such as Array and ContiguousArray.
ja: これらのカウンタはインデックスとして使われることが、ゼロ基盤の、整数インデックスでのコレクション、例えばArrayそしてContiguousArrayなどのインスタンスにおいてのみ可能です。

source: These elements are computed lazily, each time they’re read, by calling the transform function on a base element.
ja: これらの要素は、それらが読み出されるたびに、基盤要素上で変換関数を呼び出すことによって遅延計算されます。

source: These elements match those accessed through indexed NSString APIs.
ja: それらの要素は、インデックス付きNSString APIを通してアクセスされるものと一致します。

source: These letters start with "A" if uppercase is true; otherwise, with "a".
ja: uppercaseがtrueならば、これらの文字は"A"で始まります；そうでなければ、"a"で。

source: These methods all return typed pointers for further typed access to the memory.
ja: これらのメソッドは、この後で型付アクセスをこのメモリにするために型付ポインタを返します。

source: These partial periods towards the task’s completion are PartialAsyncTask.
ja: タスクのもつ完了に向かうこれら部分的な期間それらは、PartialAsyncTaskです。

source: These scalar values are combined by Unicode’s boundary algorithms into extended grapheme clusters, represented by the Swift Character type.
ja: これらのスカラー値は、ユニコード境界アルゴリズムによって拡張書記素クラスタへと、SwiftのもつCharacter型によって表されるものへと、組み合わされます。

source: These scalars are often the components of ideographic description sequences, as defined by the isIDSBinaryOperator and isIDSTrinaryOperator properties.
ja: これらのスカラーは、しばしば表意文字記述シーケンスの構成要素です、isIDSBinaryOperatorとisIDSTrinaryOperatorプロパティによって定義されるように。

source: They have no visible glyph or advance width in and of themselves, although they may affect the display, positioning, or adornment of adjacent or surrounding characters.
ja: それらは、可視の字体または送り幅をそれら自体持ちません、とはいえそれらは、隣接または囲んでいる文字の表示、位置決定、もしくは装飾に影響を及ぼすかもしれません。

source: This assignment to the nextStop constant calls this string literal initializer behind the scenes.
ja: nextStop定数への代入はこの文字列リテラルイニシャライザを舞台裏で呼びます。

source: This associated type appears as a requirement in the Sequence protocol, but it is restated here with stricter constraints.
ja: この関連型は、Sequenceプロトコルの中のある要件として現れます、しかしここでより厳格な制約で言い直されます。

source: This buffer can then be shared by different copies of a string.
ja: このバッファは、それからある文字列の異なるコピーによって共有されることができます。

source: This buffer pointer’s baseAddress must be nil or a pointer to a memory block previously returned by a Swift allocation method.
ja: このバッファポインタのbaseAddressは、nilまたは以前にSwiftアロケーションメソッドによって返されたメモリブロックへのポインタでなければなりません。

source: This buffer pointer’s count must be equal to the originally allocated size of the memory block.
ja: このバッファポインタのもつcountは、もともとアロケートされたメモリブロックのサイズと等しくなければなりません。

source: This buffer pointer’s byte count must be equal to the originally allocated size of the memory block.
ja: このバッファポインタのもつcountバイトは、もともとアロケートされたメモリブロックのサイズと等しくなければなりません。

source: This chapter describes the global functions defined in the Swift standard library.
ja: この章は、Swift標準ライブラリにおいて定義されるグローバル関数を記述します。

source: This code shows a custom interpolation type’s declaration of an appendInterpolation method that provides special validation for user input:
ja: このコードは、あるあつらえの補間型のもつappendInterpolationの宣言を示します、それはユーザ入力に対する特別な検証を提供します。

source: This continuation type can be called more than once, unlike the unsafe and checked counterparts.
ja: この継続型は、一度以上呼び出されることが可能です、非安全なそして検査される相当物とは異なります。

source: This documentation comment was inherited from AsyncSequence.
ja: この文書化コメントは、AsyncSequenceから引き継がれました。

source: This documentation comment was inherited from BidirectionalCollection.
ja: この文書化コメントは、BidirectionalCollectionから引き継がれました。

source: This documentation comment was inherited from BinaryInteger.
ja: この文書化コメントは、BinaryIntegerから引き継がれました。

source: This documentation comment was inherited from Collection.
ja: この文書化コメントは、Collectionから引き継がれました。

source: This documentation comment was inherited from Comparable.
ja: この文書化コメントは、Comparableから引き継がれました。

source: This documentation comment was inherited from CustomDebugStringConvertible.
ja: この文書化コメントは、CustomDebugStringConvertibleから引き継がれました。

source: This documentation comment was inherited from CustomReflectable.
ja: この文書化コメントは、CustomReflectableから引き継がれました。

source: This documentation comment was inherited from CustomStringConvertible.
ja: この文書化コメントは、CustomStringConvertibleから引き継がれました。

source: This documentation comment was inherited from Equatable.
ja: この文書化コメントは、Equatableから引き継がれました。

source: This documentation comment was inherited from ExpressibleByArrayLiteral.
ja: この文書化コメントは、ExpressibleByArrayLiteralから引き継がれました。

source: This documentation comment was inherited from ExpressibleByExtendedGraphemeClusterLiteral.
ja: この文書化コメントは、ExpressibleByExtendedGraphemeClusterLiteralから引き継がれました。

source: This documentation comment was inherited from ExpressibleByIntegerLiteral.
ja: この文書化コメントは、ExpressibleByIntegerLiteralから引き継がれました。

source: This documentation comment was inherited from ExpressibleByStringInterpolation.
ja: この文書化コメントは、ExpressibleByStringInterpolationから引き継がれました。

source: This documentation comment was inherited from ExpressibleByStringLiteral.
ja: この文書化コメントは、ExpressibleByStringLiteralから引き継がれました。

source: This documentation comment was inherited from ExpressibleByUnicodeScalarLiteral.
ja: この文書化コメントは、ExpressibleByUnicodeScalarLiteralから引き継がれました。

source: This documentation comment was inherited from FixedWidthInteger.
ja: この文書化コメントは、FixedWidthIntegerから引き継がれました。

source: This documentation comment was inherited from Hashable.
ja: この文書化コメントは、Hashableから引き継がれました。

source: This documentation comment was inherited from IteratorProtocol.
ja: この文書化コメントは、IteratorProtocolから引き継がれました。

source: This documentation comment was inherited from LazySequenceProtocol.
ja: この文書化コメントは、LazySequenceProtocolから引き継がれました。

source: This documentation comment was inherited from LosslessStringConvertible.
ja: この文書化コメントは、LosslessStringConvertibleから引き継がれました。

source: This documentation comment was inherited from MutableCollection.
ja: この文書化コメントは、MutableCollectionから引き継がれました。

source: This documentation comment was inherited from RandomAccessCollection.
ja: この文書化コメントは、RandomAccessCollectionから引き継がれました。

source: This documentation comment was inherited from RangeReplaceableCollection.
ja: この文書化コメントは、RangeReplaceableCollectionから引き継がれました。

source: This documentation comment was inherited from RawRepresentable.
ja: この文書化コメントは、RawRepresentableから引き継がれました。

source: This documentation comment was inherited from SIMD.
ja: この文書化コメントは、SIMDから引き継がれました。

source: This documentation comment was inherited from SIMDStorage.
ja: この文書化コメントは、SIMDStorageから引き継がれました。

source: This documentation comment was inherited from Sequence.
ja: この文書化コメントは、Sequenceから引き継がれました。

source: This documentation comment was inherited from Strideable.
ja: この文書化コメントは、Strideableから引き継がれました。

source: This documentation comment was inherited from TextOutputStream.
ja: この文書化コメントは、TextOutputStreamから引き継がれました。

source: This documentation comment was inherited from TextOutputStreamable.
ja: この文書化コメントは、TextOutputStreamableから引き継がれました。

source: This documentation comment was inherited from UnkeyedEncodingContainer.
ja: この文書化コメントは、UnkeyedEncodingContainerから引き継がれました。

source: This documentation comment was inherited from _CustomPlaygroundQuickLookable.
ja: この文書化コメントは、_CustomPlaygroundQuickLookableから引き継がれました。

source: This documentation comment was inherited from _UnicodeEncoding.
ja: この文書化コメントは、_UnicodeEncodingから引き継がれました。

source: This documentation comment was inherited from _UnicodeParser.
ja: この文書化コメントは、_UnicodeParserから引き継がれました。

source: This documentation contains preliminary information about an API or technology in development.
ja: この文書は、開発でのテクノロジーまたはAPIのための事前の情報を含んでいます。

source: This example appends the elements of a Range<Int> instance to an array of integers.
ja: 例えば、あなたはあるRange<Int>インスタンスに属する複数要素を整数の配列に追加することができます。

source: This example checks to see whether a favorite actor is in an array storing a movie’s cast.
ja: この例は、映画出演者を格納する配列の中にお気に入りの俳優がいるかどうか確認するために調べます。

source: This example creates a ClosedRange<Character> from “a” up to, and including, “z”.
ja: この例は、「a」から「z」までの、そしてそれを含むClosedRange<Character>を作成します。

source: This example creates a PartialRangeFrom<Double> instance that includes any value greater than or equal to 5.0.
ja: この例は、PartialRangeFrom<Double>インスタンスで5.0より大きいか等しい何らかの値を含むものを作成します。

source: This example creates a PartialRangeThrough<Double> instance that includes any value less than or equal to 5.0.
ja: この例は、PartialRangeThrough<Double>インスタンスで5.0より少ないか等しい何らかの値を含むものを作成します。

source: This example creates a PartialRangeUpTo<Double> instance that includes any value less than 5.0.
ja: この例は、PartialRangeUpTo<Double>インスタンスで5.0より少ない何らかの値を含むものを作成します。

source: This example creates a Range<Double> from zero up to, but not including, 5.0.
ja: この例は、ゼロから5.0までの、しかしそれを含めないRange<Double>を作成します。

source: This example creates three new values in the range 1...100.
ja: この例は、３つの新しい値を範囲1...100において作成します。

source: This example creates three new values in the range 1..<100.
ja: この例は、３つの新しい値を範囲1..<100において作成します。

source: This example declares the numberOfCookies constant, using an integer literal to express its value:
ja: この例は、numberOfCookies定数を宣言します、整数リテラルをそれの値を表すために使っています：

source: This example defines a rawData string with some unstructured data, and then uses the string’s prefix(while:) method to create a substring of the numeric prefix:
ja: この例は、rawData文字列を何らかの構造化されていないデータで定義します、それからその文字列のもつprefix(while:)メソッドを使うことで数字接頭辞からなる下位文字列を作成します。

source: This example demonstrates getting a slice from a buffer of strings, finding the index of one of the strings in the slice, and then using that index in the original buffer.
ja: この例はいくらかの文字列からなるバッファからスライスを取得する実演をします、スライスの中の文字列の１つのインデックスを見つけて、それからそのインデックスを元のバッファにおいて使います。

source: This example demonstrates getting a slice of an array of strings, finding the index of one of the strings in the slice, and then using that index in the original array.
ja: この例は文字列からなる配列のあるスライスの取得を実演します、スライスの中の文字列の１つのインデックスを見つけて、それからそのインデックスを元の配列において使います。

source: This example enumerates the characters of the string “Swift” and prints each character along with its place in the string.
ja: この例は文字列「Swift」の文字を列挙します、そして各文字をその文字列でのそれの場所とともに出力します。

source: This example finds the index of the last name that begins with the letter A:
ja: この例は、文字A:で始まる、最後の名前のインデックスを見つけます：

source: This example finds the largest value in an array of height measurements.
ja: この例は、身長計測の配列の中で最も大きな値を見つけます。

source: This example finds the smallest value in an array of height measurements.
ja: この例は、身長計測の配列の中で最も小さな値を見つけます。

source: This example first finds the position of a space (UTF-16 code point 32) in a string’s utf16 view and then uses this method to find the same position in the string’s unicodeScalars view.
ja: この例は、ある空白（UTF-16コード点32）の位置を文字列のもつutf16ビューの中で見つけて、それからこのメソッドを使って文字列のもつunicodeScalarsビューにおける同じ位置を捜します。

source: This example first finds the position of a space (UTF-8 code point 32) in a string’s utf8 view and then uses this method find the same position in the string.
ja: この例は、ある空白（UTF-8コード点32）の位置を文字列のもつutf8ビューの中で見つけて、それからこのメソッドを使って文字列における同じ位置を捜します。

source: This example first finds the position of the character "é" and then uses this method find the same position in the string’s utf16 view.
ja: この例は、最初に文字"é"の位置を見つけて、それからこのメソッドを使って文字列のもつutf16ビューにおける同じ位置を捜します。

source: This example first finds the position of the character "é", and then uses this method find the same position in the string’s utf8 view.
ja: この例は、最初に文字"é"の位置を見つけて、それからこのメソッドを使って文字列のもつutf8ビューにおける同じ位置を見つけます。

source: This example iterates over the indices and elements of a set, building a list consisting of indices of names with five or fewer letters.
ja: この例は、ある集合のインデックスと要素のすべてにわたって反復します、５つまたはより少ない文字を持つ名前のインデックスから成るリストを作ります。

source: This example passes intPointer, a pointer to an Int value, to print(address:).
ja: この例はintPointer、Int値へのポインタをprint(address:)に渡します。

source: This example passes rawPointer as the initial parameter.
ja: この例は、rawPointerを最初のパラメータとして渡します。

source: This example passes intPointer, a mutable pointer to an Int value, to print(address:).
ja: この例はintPointer、Int値への可変ポインタをprint(address:)に渡します。

source: This example picks a name at random from an array:
ja: この例は、ある名前を無作為に配列から選出します。

source: This example prints the characters of a string in reverse order:
ja: この例は、ある文字列に属する文字を逆順で出力します。

source: This example removes all the vowels from a string:
ja: この例は、全ての母音を文字列から除去します：

source: This example removes the hyphen from the middle of a string.
ja: この例は、ある文字列の真ん中からハイフンを削除します。

source: This example removes the middle element from an array of measurements.
ja: この例は、測定結果からなる配列から真ん中の要素を削除します。

source: This example removes three elements from the middle of an array of measurements.
ja: この例は、測定結果からなる配列の真ん中から３つの要素を削除します。

source: This example searches streetsSlice for one of the strings in the slice, and then uses that index in the original array.
ja: この例は、streetsSliceをスライスの中の文字列の１つについて検索して、それからそのインデックスを元々の配列において使います。

source: This example shows how an array of [Int] instances can be joined, using another [Int] instance as the separator:
ja: この例は、どのようにいくつかの[Int]インスタンスからなる配列が別の[Int]インスタンスを分離子として使ってつなぎ合わされるかを示します。

source: This example shows how to build a dictionary of letter frequencies of a string.
ja: この例は、ある文字列の文字頻度の辞書を作り上げる方法を示します。

source: This example shows how to find the sum of an array of numbers.
ja: この例は、どのように数からなる配列の合計を見出すかを示します。

source: This example shows how to use the max(by:) method on a dictionary to find the key-value pair with the highest value.
ja: この例は、max(by:)メソッドを辞書上で使って、最も高い値を持つキー値ペアを見つける方法を示します。

source: This example shows how to use the min(by:) method on a dictionary to find the key-value pair with the lowest value.
ja: この例は、min(by:)メソッドを辞書上で使って、最も低い値を持つキー値ペアを見つける方法を示します。

source: This example shows how you can check an array for an expense greater than $100.
ja: この例は、どのようにあなたが$100より大きい出費についてある配列を調べるかを示します。

source: This example shows how you can modify one of the names in an array of students.
ja: この例が示すのは、どうやってあなたが学生らの配列の中の名前の１つを修正できるかです。

source: This example shows the different ways that you can call a function that takes a constant raw pointer:
ja: この例は、あなたが定数の生のポインタを取るある関数を呼び出し可能な異なる方法を示します。

source: This example shows the different ways that you can call a function that takes a mutable pointer:
ja: この例は、あなたが可変ポインタを取る関数を呼び出し可能な異なる方法を示します。

source: This example shows the different ways that you can call a function that takes a mutable raw pointer:
ja: この例は、あなたが変数の生のポインタを取るある関数を呼び出し可能な異なる方法を示します。

source: This example shows the different ways that you can call the a function that takes a constant pointer:
ja: この例は、あなたが定数ポインタを取る関数を呼び出し可能な異なる方法を示します。

source: This example tests whether one countable range begins with the elements of another countable range.
ja: この例は、ある可付番範囲が別の可付番範囲の要素で始まるかどうかテストします。

source: This example tests whether one countable range shares the same elements as another countable range and an array.
ja: この例は、ある可付番範囲が同じ要素を別の可付番範囲とそしてある配列と共有するかどうかをテストします。

source: This example uses implicit bridging to pass a pointer to the elements of numbers when calling print(address:as:).
ja: この例は、print(address:as:)を呼び出す時に、暗黙的ブリッジを使ってnumbersの要素へのポインタを渡します。

source: This example uses implicit bridging to pass a pointer to the elements of numbers when calling printInt(atAddress:).
ja: この例は、暗黙的ブリッジを使ってポインタをnumbersの要素へと、printInt(atAddress:)を呼び出す時に渡します。

source: This example uses the last(where:) method to find the last negative number in an array of integers:
ja: この例は、last(where:)メソッドを使って、整数の配列において最後の負数を見つけます：

source: This example uses the lexicographicallyPrecedes method to test which array of integers comes first in a lexicographical ordering.
ja: この例はlexicographicallyPrecedesメソッドを使って、どの整数配列がある語彙筆記的順序において最初に来るかをテストします。

source: This function does not block the underlying thread.
ja: この関数は、基礎をなすスレッドを遮断しません。

source: This function does not infer element moves.
ja: この関数は、要素が移動することを推測しません。

source: This function is the only requirement of the Comparable protocol.
ja: この関数は、Comparableプロトコルのただ１つの要件です。

source: This function may be called even from within child (or any other) tasks, and causes the group to be canceled.
ja: この関数は、子（または何か他の）タスク内部からでさえ呼び出されるかもしれません、そしてグループが取り消されることを引き起こします。

source: This function throws an error if any values are invalid for the given encoder’s format.
ja: この関数は、与えられたエンコーダの形式に対して何らかの値が無効であるならばエラーをスローします。

source: This includes some scalars that are not typically considered to be emoji:
ja: これは、概してemojiであると考えられない幾つかのスカラーを含みます：

source: This index must be a valid index of String(unicodeScalars).utf16.
ja: このインデックスはString(unicodeScalars).utf16の有効なインデックスでなければなりません。

source: This index must be a valid index of at least one view of characters.
ja: このインデックスは、charactersの少なくとも１つのビューで有効なインデックスでなければなりません。

source: This index must be a valid index of at least one view of the string shared by unicodeScalars.
ja: このインデックスは、unicodeScalarsによって共有される文字列の少なくとも１つのビューの有効なインデックスでなければなりません。

source: This index must be a valid index of at least one view of the string shared by utf16.
ja: このインデックスは、utf16によって共有される文字列の少なくとも１つのビューの有効なインデックスでなければなりません。

source: This index must be a valid index of at least one view of the string shared by utf8.
ja: このインデックスは、utf8によって共有される文字列の少なくとも１つのビューの有効なインデックスでなければなりません。

source: This information is subject to change, and software implemented according to this documentation should be tested with final operating system software.
ja: この情報は変更される場合があり、この文書に沿って実装されるソフトウェアは最終的なオペレーティングシステム・ソフトウェアでテストされなければなりません。

source: This initializer creates a new pointer to the same address as other and performs no allocation or copying.
ja: このイニシャライザは、新しいポインタをotherと同じアドレスに作成して、割り当てやコピーを実行することはありません。
